# Тимур записал телефоны всех своих друзей, чтобы автоматизировать 
# поиск нужного номера.
# У каждого из друзей Тимура может быть один или более телефонных номеров.
# Напишите программу, которая поможет Тимуру находить все номера определённого друга.
# Формат входных данны
# В первой строке задано одно целое число nnn — количество номеров телефонов,
# информацию о которых Тимур сохранил в телефонной книге.
# В следующих nnn строках заданы телефоны и имена их владельцев через пробел.
# В следующей строке записано целое число mmm — количество поисковых запросов от Тимура. 
# В следующих mmm строках записаны сами запросы, по одному на строке.
# Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.
# Формат выходных данных
# Для каждого запроса от Тимура выведите в отдельной строке все телефоны,
# принадлежащие человеку с этим именем (независимо от регистра имени).
# Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей
# строке «абонент не найден» (без кавычек).
# Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке,
# в каком они были заданы во входных данных.
# Примечание 2. Количество строк в ответе должно быть равно числу mmm.
# Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв
# русского или английского алфавита. Записи не повторяются.

n = int(input())

dict_number_name = {}

for i in range(n):
    s = input().split()
    dict_number_name[s[1].lower()] = (dict_number_name.get(s[1].lower(), '')) + ' ' + (s[0])

    

m = int(input())

list_name = []

for i in range(m):
    list_name.append(input().lower())


for i in list_name:
    for name, number in dict_number_name.items():
        if (i == name):
            print(*number.split())
    if not(i in dict_number_name):        
        print('абонент не найден')

