# Напишите программу для расшифровки секретного слова методом частотного анализа.
# Формат входных данных
# В первой строке задано зашифрованное слово. Во второй строке задано одно целое
# число nnn – количество букв в словаре. В следующих nnn строках записано,
# сколько раз конкретная буква алфавита встречается в этом слове – <буква>: <частота>.
# Формат выходных данных
# Программа должна вывести дешифрованное слово.
# Примечание. Гарантируется, что частоты букв не повторяются.

cipher = input()

n = int(input())

dict_letter = {}

for i in range(n):
    letter = input().split(': ')
    dict_letter[letter[0]] = letter[1]

for i in cipher:
    count_letter = cipher.count(i)
    for letter, freq in dict_letter.items():
        if (count_letter == int(freq)):
            print(letter, end = '')

