# Вам дан словарь, состоящий из пар слов-синонимов.
# Повторяющихся слов в словаре нет. Напишите программу, 
# которая для одного данного слова определяет его синоним.
# Формат входных данных
# На вход программе подается количество пар синонимов nnn.
# Далее следует nnn строк, каждая строка содержит два слова-синонима.
# После этого следует одно слово, синоним которого надо найти.
# Формат выходных данных
# Программа должна вывести одно слово, синоним введенного.
# Примечание 1. Гарантируется, что синоним введенного слова существует в словаре.
# Примечание 2. Все слова в словаре начинаются с заглавной буквы.

n = int(input())

dict_synon = {}

for i in range(n):
    s = input().split()
    dict_synon[s[0]] = s[1]

synon = input()

for i, j in dict_synon.items():
    if(i == synon):
        print(j)
    if(j == synon):
        print(i)