# На вход программе подается список стран и городов каждой страны.
# Затем даны названия городов. Напишите программу, 
# которая для каждого города выводит, в какой стране он находится.
# Формат входных данных
# Программа получает на вход количество стран nnn. Далее идет nnn строк,
# каждая строка начинается с названия страны, затем идут названия
# городов этой страны. В следующей строке записано число mmm, далее
# идут mmm запросов — названия каких-то mmm городов, из перечисленных выше.
# Формат выходных данных
# Программа должна вывести название страны, в которой находится 
# данный город в соответствии с примером.


n = int(input())

dict_country_city = {}

for i in range(n):
    s = input().split()
    dict_country_city[s[0]] = s[1:]

m = int(input())

list_city = []

for i in range(m):
    list_city.append(input())

for i in list_city:
    for country, city in dict_country_city.items():
        if (i in city):
            print(country)
            

