# Программисты, как вы уже знаете, постоянно учатся, а в общении между
# собой используют весьма специфический язык. Чтобы систематизировать ваш 
# пополняющийся профессиональный лексикон, мы придумали эту задачу.
# Напишите программу создания небольшого словаря сленговых программерских выражений,
# чтобы она потом по запросу возвращала значения из этого словаря.
# Формат входных данных
# В первой строке задано одно целое число nnn — количество слов в словаре.
# В следующих nnn строках записаны слова и их определения, разделенные двоеточием 
# и символом пробела. В следующей строке записано целое число mmm — количество поисковых слов,
# чье определение нужно вывести. В следующих mmm строках записаны сами слова, по одному на строке.
# Формат выходных данных
# Для каждого слова, независимо от регистра символов, если оно присутствует в словаре,
# необходимо вывести его определение. Если слова в словаре нет, 
# программа должна вывести "Не найдено", без кавычек.
# Примечание 1. Мини-словарь для начинающих разработчиков можно посмотреть тут.
# Примечание 2. Гарантируется, что в определяемом слове или фразе отсутствует двоеточие (:), 
# следом за которым идёт пробел.

n = int(input())

dict_def = {}

for i in range(n):
    s = input().split(': ')
    dict_def[s[0].lower()] = s[1]

    
m = int(input())
for i in range(m):
    x = dict_def.get(input().lower(),'Не найдено')
    print(x)