# Назовем строку текста «почти палиндромом», если найдется такой буквенный символ, при удалении которого строка станет палиндромом. При этом все символы, кроме букв, должны игнорироваться.
# 
# Напишите программу, которая определяет, является ли строка «почти палиндромом».
# 
# Формат входных данных
# На вход программе подается строка текста, состоящая только из букв латинского алфавита в нижнем регистре, цифр и символов !"#$%&'()*+,-./:;<=>?@[\]^_`{|}~. Длина строки не превышает 300000300000300000 символов. Гарантируется, что строка содержит как минимум две буквы.
# 
# Формат выходных данных
# Программа должна вывести True, если введенная строка является «почти палиндромом», или False в противном случае.
# 
# Примечание. Палиндром читается одинаково в обоих направлениях, например слово «rotavator».

def polyn(x):
    return x == x[::-1]

    
str1 = input()
xs = []
for i in str1:
    if i.isalpha():
        xs.append(i)
for i in range(len(xs)):
    if polyn(xs[:i] + xs[i + 1:]):
        print(True)
        break

