# Реализуйте функцию beegeek(), которая принимает два целочисленных аргумента a и b,
# где a≤ba, и возвращает строку, составленную из чисел от a до b включительно
# или слов Bee, Geek и BeeGeek по следующему правилу:
# 
#     если число делится без остатка на 3, то вместо него в строку добавляется слово Bee;
#     если число делится без остатка на 7, то вместо него в строку добавляется слово Geek;
#     если число делится без остатка и на 3, и на 7, то вместо него в строку добавляется слово BeeGeek;
#     в остальных случаях в строку добавляется само число.
# 
# Примечание 1. Числа и слова в формируемой строке должны разделяться символов пробела.
# 
# Примечание 2. В тестирующую систему сдайте программу, содержащую только необходимую функцию beegeek(), но не код, вызывающий ее.


def beegeek(x,y):
    xs = []
    for i in range(x,y + 1):
        if(i % 3 == 0 and i % 7 == 0):
            xs.append('BeeGeek')
        elif(i % 7 == 0):
            xs.append('Geek')
        elif(i % 3 == 0):
            xs.append('Bee')
        else:
            xs.append(f'{i}')
    return ' '.join(xs)
