# Код писать сюда \(❤‿❤)/


# Напишите программу, которая выводит nnn первых элементов
# последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5… 
# (число повторяется столько раз, чему оно равно).
# 
# Формат входных данных
# На вход программе подается положительное целое число n (n≤200000),
 
# Формат выходных данных
# Программа должна вывести указанную последовательность чисел, разделённых пробелом.

n = int(input())
x = 0
xs = []

def triangle_number(x):
    i = 0
    xs = []
    while x >= 1: 
        i += 1
        x = x - i   
        xs.append(f'{i} ' * i)

    return xs, x

xs, x = triangle_number(n)
if x == 0:
    print(*(''.join(xs).split()))
else:
    print(*(''.join(xs).split()[:x]))
