# Строковое представление
# Напишите программу, которая будет превращать натуральное
# число в строку, заменяя все цифры в числе на слова:
#     000 на zero;
#     111 на one;
#     222 на two;
#     333 на three;
#     444 на four;
#     555 на five;
#     666 на six;
#     777 на seven;
#     888 на eight;
#     999 на nine.
# Формат входных данных
# На вход программе подается натуральное число.
# Формат выходных данных
# Программа должна вывести строковое представление числа.
# Примечание. Используйте словарь вместо условного оператора.

# put your python code here
# put your python code here

n = int(input())
list_city = []
for i in range(n + 1):
    s = input()
    list_city.append(s)


if (len(list_city)) - (len(list(set(list_city))))  == 0:
    print('OK')
else:
    print('REPEAT')






d = {
    "CS101": "CS101: 3004, Хайнс, 8:00",
    "CS102": "CS102: 4501, Альварадо, 9:00",
    "CS103": "CS103: 6755, Рич, 10:00",
    "NT110": "NT110: 1244, Берк, 11:00",
    "CM241": "CM241: 1411, Ли, 13:00"
}
n = input()


print((d[n]))

