# Строковое представление
# Напишите программу, которая будет превращать натуральное
# число в строку, заменяя все цифры в числе на слова:
#     000 на zero;
#     111 на one;
#     222 на two;
#     333 на three;
#     444 на four;
#     555 на five;
#     666 на six;
#     777 на seven;
#     888 на eight;
#     999 на nine.
# Формат входных данных
# На вход программе подается натуральное число.
# Формат выходных данных
# Программа должна вывести строковое представление числа.
# Примечание. Используйте словарь вместо условного оператора.

d = {
    "0": "zero",
    "1": "one",
    "2": "two",
    "3": "three",
    "4": "four",
    "5": "five",
    "6": "six",
    "7": "seven",
    "8": "eight",
    "9": "nine"
}
n = input()
new_number = []
for i in n:
    for key, value in d.items(): 
        if (i == key):
            new_number.append(value)

print(*(new_number))