# На вход программе подается строка текста.
# Напишите программу, которая выводит слово, которое встречается реже всего,
# без учета регистра. Если таких слов несколько, выведите то,
# которое меньше в лексикографическом порядке.
# Формат входных данных
# На вход программе подается строка текста.
# Формат выходных данных
# Программа должна вывести слово (в нижнем регистре), встречаемое реже всего.
# Примечание 1. Программа не должна быть чувствительной к регистру,
# слова apple и Apple должна воспринимать как одинаковые.
# Примечание 2. Слово — последовательность букв. Кроме слов в тексте могут
# присутствовать пробелы и знаки препинания .,!?:;-, 
# которые нужно игнорировать. Других символов в тексте нет.

s = input().lower()

# выкинули все символы не из списка
s1 = []
for i in s:
    if i in 'abcdefghijklmnopqrstuvwxyz0123456789яфйцычсвукамипенртьогшлбюдщзжэхъ ':
        s1.append(i)

s = ''.join(s1).split()

result = {}
for num in s:
    result[num] = result.get(num, 0) + 1


list_fruct = []
for (i, j) in result.items():
    if(j == min(result.values())):
        list_fruct.append(i)

print(sorted(list_fruct)[0])