# Напишите программу, записывающую в текстовый файл random.txt 252525 случайных чисел в диапазоне от 111111111 до 777777777 (включительно), каждое с новой строки.
# 
# Формат входных данных
# На вход программе ничего не подается.
# 
# Формат выходных данных
# Программа должна создать файл с именем random.txt и записать в него случайные числа в соответствии с условием задачи.
# 
# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
# 
# Примечание 2. Для генерации случайных чисел используйте модуль random.

from random import shuffle
with open('random.txt', 'w', encoding='utf-8') as output:
    random_list = [i for i in range(111, 778)]
    shuffle(random_list)
    print(*random_list[:25], sep = '\n', file=output)





