# Дано натуральное число nnn и два комплексных числа z1, z2z_1, \, z_2z1​,z2​.
# Напишите программу, которая вычисляет и выводит значение выражения
# z1n+z2n+z1ˉn+z2ˉn+1.z_1^n + z_2^n + \bar{z_1}^n + \bar{z_2}^{n+1}.
# z1n​+z2n​+z1​ˉ​n+z2​ˉ​n+1.
# Формат входных данных
# На вход программе подается натуральное число nnn и два комплексных числа
# z1z_1z1​ и z2z_2z2​, каждое на отдельной строке.
# Формат выходных данных
# рограмма должна вывести ответ на задачу.
# Примечание. Число z1ˉ\bar{z_1}z1​ˉ​ является сопряженным к числу z1z_1z1​.

n = int(input())
z1 = complex(input())
z2 = complex(input())

print(z1 ** n + z2 ** n + z1.conjugate() ** n + z2.conjugate() ** (n+1) )