# Дана строка текста на русском языке, состоящая из слов и символов пробела.
# Словом считается последовательность букв, 
# слова разделены одним пробелом или несколькими.
# Напишите программу, определяющую для каждого слова порядковый номер
# его вхождения в текст именно в этой форме, с учетом регистра.
# Для первого вхождения слова программа выведет 111, 
# для второго вхождения того же слова — 222 и т. д.
# Формат входных данных
# Программа получает на вход единственную строку текста, 
# состоящую только из русских букв и символов пробела. 
# Формат выходных данных
# Для каждого слова исходного текста программа выводит одно целое число —
# номер вхождения этого слова в текст.
# Числа необходимо выводятся на одной строке, через пробел.
# Примечание. Количество чисел должно совпадать с количеством слов исходного текста.


s = input().split()

result = {}
for num in s:
    result[num] = result.get(num, 0) + 1
    print(result[num], end = ' ')

print(result)