# Руководитель онлайн-школы BEEGEEK и его помощник составили списки учеников их школы.
# Напишите программу, которая выведет все фамилии учеников,
# которые вспомнили руководитель и его помощник.
# Формат входных данных
# На вход программе в первой строке подаются фамилии, записанные руководителем школы, 
# а на второй строке - помощником руководителя. Фамилии указываются через пробел.
# Формат выходных данных
# Программа должна вывести все фамилии учеников, 
# отсортированных в лексикографическом порядке, записанные руководителем и его помощником.

s1 = set(input().split())
s2 = set(input().split())

print(*sorted(list(s1 | s2)))
