# Каждый ученик, обучающийся в онлайн-школе BEEGEEK изучает либо математику,
# либо информатику, либо оба этих предмета. У руководителя школы есть списки учеников,
# изучающих каждый предмет. Случайно списки всех учеников перемешались.
# Напишите программу, которая позволит руководителю выяснить, 
# сколько учеников изучает только один предмет.
# Формат входных данных
# На вход программе в первых двух строках подаются числа m и n – количества учеников,
# изучающих математику и информатику соответственно. 
# Далее идут m+nm+nm+n строк — фамилии учеников, изучающих математику и информатику, в произвольном порядке.
# Формат выходных данных
# Программа должна вывести количество учеников, которые изучают только один предмет.
# Если таких учеников не окажется, то необходимо вывести NO.
# Примечание. Гарантируется, что среди учеников школы BEEGEEK нет однофамильцев.

m = int(input())
n = int(input())


students = []
students_diff = []
for i in range(n + m):
    s = input()
    if s in students:
        students_diff.append(s)    
    else:
        students.append(s)  

score = (len(set(students).symmetric_difference(set(students_diff))))

if score == 0:
    print('NO')
else:
    print(score)