# Вам доступен текстовый файл numbers.txt, 
# каждая строка которого может содержать одно или несколько целых чисел,
# разделенных одним или несколькими пробелами.
# 
# Напишите программу, которая вычисляет сумму чисел в каждой строке
# и выводит эту сумму на экран 
# (для каждой строки выводится сумма чисел в этой строке).
# 
# Формат входных данных
# На вход программе ничего не подается.
# 
# Формат выходных данных
# Программа должна вывести сумму чисел в каждой строке.
# 
# Примечание 1. Если бы файл numbers.txt содержал строки:

with open('numbers.txt', 'r', encoding='utf-8') as file:
    lines = map(lambda x: sum(map(int, x.split())), file.readlines())
    print(*lines, sep = '\n')
       