# Вам доступен текстовый файл population.txt с названиями стран
# и численностью их населения, разделенными символом табуляции '\t'.
# 
# Напишите программу выводящую все страны, название которых начинается
# с буквы 'G', численность населения которых больше чем
# 500 000500 \, 000500000 человек, не меняя их порядок.
# 
# Формат входных данных
# На вход программе ничего не подается.
# 
# Формат выходных данных
# Программа должна вывести названия стран, удовлетворяющие условиям задачи,
# каждое на отдельное строке.
# 
# Примечание. Указанный файл можно скачать по ссылке.

file = open('population.txt', 'r', encoding='UTF-8')

table = map(lambda x: x.split('\t'), file.readlines())
contries = filter(lambda x: (x[0][0] == 'G' and int(x[1])) > 500000, table)
for i in contries:
    print(i[0])
file.close()