# Вам доступен текстовый файл nums.txt. В файле могут быть записаны
# целые неотрицательные числа и все, что угодно.
# Числом назовем последовательность одной и более цифр, 
# идущих подряд (число всегда неотрицательно).
# 
# Напишите программу, которая вычисляет сумму всех чисел, записанных в файле.
# 
# Формат входных данных
# На вход программе ничего не подается.
# 
# Формат выходных данных
# Программа должна вывести сумму всех чисел, записанных в файле.
# 
# Примечание 1. Если бы файл nums.txt содержал строки:

from re import findall
with open('nums.txt', 'r', encoding='utf-8') as file:
    lines = [findall(r'\d+', line) for line in file.readlines()]
    x = sum(map(lambda x: sum(map(int, x)), lines))
    print(x)   
