# Напишите программу для вывода общего количества уникальных символов во всех считанных словах без учета регистра.
# Формат входных данных
# На вход программе в первой строке подается число nnn – общее количество слов. Далее идут nnn строк с словами.
# Формат выходных данных
# Программа должна вывести одно число – общее количество уникальных символов во всех словах без учета регистра.

n = int(input())

unique_char = []
for i in range(n):
    unique_char.extend((input().lower()))

print(len(set(unique_char)))