# На вход программе подается натуральное число n,
# а затем nnn различных натуральных чисел, каждое на отдельной строке.
# Напишите программу, которая выводит все общие цифры в порядке возрастания
# у всех введенных чисел.
# Формат входных данных
# На вход программе подаются натуральное число n≥1n
# \ge 1n≥1, а затем nnn различных натуральных чисел, каждое на отдельной строке.
# Формат выходных данных
# Программа должна вывести цифры в соответствии с условием задачи. Если общих цифр нет, то ничего выводить не нужно.

n = int(input())

sum = set(input())
for i in range(n - 1):
    s1 = set(input())
    sum = sum.intersection(s1)

print(*sorted(sum))