# На вход программе подаются две строки текста, содержащие числа.
# Напишите программу, которая выводит все числа в порядке возрастания,
# которые есть как в первой строке, так и во второй.
# Формат входных данных
# На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.
# Формат выходных данных
# Программа должна вывести множество чисел, встречающихся в обеих строках.



s1 = set(map(lambda x: int(x), input().split()))
s2 = set(map(lambda x: int(x), input().split()))

print (*sorted(s1.intersection(s2)))