# Даны по 101010-балльной шкале оценки по биологии трех учеников.
# Напишите программу, которая выводит множество оценок, 
# не встречающихся ни у одного из трех учеников.
# Формат входных данных
# На вход программе подаются оценки трех учеников,
# разделенные символом пробела (оценки каждого ученика на отдельной строке).
# Формат выходных данных
# Программа должна вывести множество оценок в порядке возрастания на
# одной строке, разделенных пробелами, в соответствии с условием задачи.
# Примечание. Оценка ученика находится в диапазоне от 000 до 101010 включительно.


s1 = set(map(lambda x: int(x), input().split()))
s2 = set(map(lambda x: int(x), input().split()))
s3 = set(map(lambda x: int(x), input().split()))

print(*((sorted(set(range(11)) - (s1 | s2 | s3)) )))